app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Three"], ["description", "Three Three Three Three"], ["price", 123.45], ["created_at", "2023-08-25 11:21:12.372194"], ["updated_at", "2023-08-25 11:21:12.372194"]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Three 3"], ["description", "Three 3 Three 3 Three 3 Three 3"], ["price", 3123.45], ["updated_at", "2023-08-25 11:24:25.444836"], ["id", 3]]